// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// Console.Write("Введите число: ");
// string number = Console.ReadLine();

// void Number1(string number){
//   if (number[0]==number[4] & number[1]==number[3])
//     Console.WriteLine($"Число: {number} - палиндром.");  
//   else Console.WriteLine($"Число: {number} - не палиндром.");
// }
// if (number.Length == 5)
//   Number1(number);
// else Console.WriteLine("Error, Введите пятизначное число.");


	